#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Sat Jun 27 20:07:35 2026

add_design "D:/PDS/test/Sparrow_RISC-V/rtl/axi_arbiter_3to1.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/core.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/csr.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/div.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/idex.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/ifu.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/regs.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/sctr.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/trap.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/defines.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/e203_clkgate.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_1cyc_sram_ctrl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_bufs.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_dffs.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_icb32_to_axi64.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_icbs.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_ram.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_xchecker.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_sim_dtcm.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_sim_itcm.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_sim_ram.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_sram_icb_ctrl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/full_handshake_rx.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/full_handshake_tx.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/jtag_dm.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/jtag_driver.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/jtag_top.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/sirv_gnrl_icb32_to_axi64.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/icb_2m8s.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/iram.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/plic.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/rstc.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sparrow_soc.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sram.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/system_top.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/cmos_8_16bit.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/fram_buf.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/hdmi_ddr_ov5640_top.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/i2c_com.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/iic_dri.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ms7200_ctl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ms7210_ctl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ms72xx_ctl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/power_on_delay.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/rd_buf.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/rd_ctrl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/reg_config.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/sync_vg.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/wr_buf.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/wr_cmd_trans.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/wr_ctrl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/wr_rd_ctrl_top.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/axi_arbiter_3to1.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/core/core.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/core/csr.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/core/div.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/core/idex.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/core/ifu.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/core/regs.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/core/sctr.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/core/trap.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/defines.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/general/e203_clkgate.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_1cyc_sram_ctrl.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_bufs.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_dffs.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_icb32_to_axi64.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_icbs.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_ram.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_xchecker.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_sim_dtcm.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_sim_itcm.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_sim_ram.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_sram_icb_ctrl.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/full_handshake_rx.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/full_handshake_tx.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/jtag_dm.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/jtag_driver.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/jtag_top.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/sirv_gnrl_icb32_to_axi64.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/soc/icb_2m8s.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/soc/iram.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/soc/plic.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/soc/rstc.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sparrow_soc.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sram.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/system_top.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/cmos_8_16bit.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/fram_buf.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/hdmi_ddr_ov5640_top.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/i2c_com.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/iic_dri.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ms7200_ctl.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ms7210_ctl.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ms72xx_ctl.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/power_on_delay.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/rd_buf.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/rd_ctrl.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/reg_config.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/sync_vg.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/wr_buf.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/wr_cmd_trans.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/wr_ctrl.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/wr_rd_ctrl_top.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/core.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/csr.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/div.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/idex.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/ifu.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/regs.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/sctr.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/core/trap.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/e203_clkgate.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_1cyc_sram_ctrl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_bufs.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_dffs.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_icb32_to_axi64.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_icbs.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_ram.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_xchecker.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_sim_dtcm.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_sim_itcm.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_sim_ram.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_sram_icb_ctrl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/full_handshake_rx.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/full_handshake_tx.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/jtag_dm.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/jtag_driver.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/jtag/jtag_top.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sdrd/sd_reader.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sdrd/sdcmd_ctrl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sdrd/sdrd.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sys_perip/cnn_accel_top.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sys_perip/cnn_mac_3x3.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sys_perip/fpioa.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sys_perip/spi.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sys_perip/sys_perip.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sys_perip/timer.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sys_perip/uart.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/icb_2m8s.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/iram.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/plic.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/rstc.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sparrow_soc.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/soc/sram.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/axi_arbiter_3to1.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/config.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/defines.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/sirv_gnrl_icb32_to_axi64.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl/system_top.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/cmos_8_16bit.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/fram_buf.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/hdmi_ddr_ov5640_top.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/i2c_com.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/iic_dri.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ms72xx_ctl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ms7200_ctl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ms7210_ctl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/power_on_delay.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/rd_buf.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/rd_ctrl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/reg_config.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/sync_vg.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/wr_buf.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/wr_cmd_trans.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/wr_ctrl.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/wr_rd_ctrl_top.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/arp_cache.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/arp_mac_top.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/arp_rx.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/arp_tx.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/check_sum.vh"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/crc32_gen.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/ethernet_ddr_streamer.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/icmp.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/ip_layer.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/ip_rx.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/ip_tx.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/ip_tx_mode.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/mac_layer.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/mac_rx.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/mac_tx.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/mac_tx_mode.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/rgmii_interface.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/udp_ip_mac_top.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/udp_layer.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/udp_rx.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/udp_tx.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/image_process/binary_frame_out.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/image_process/gaussian5x5.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/image_process/image_process.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/image_process/morph_close_10x3.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/image_process/morph_close_25x3.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/image_process/otsu_binarize.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/image_process/rgb_hsv.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/image_process/rgb2gray.v"
add_design "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/image_process/sobel_x3x3.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl_ov5640/ethernet/check_sum.vh"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/general/e203_clkgate.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/sirv_gnrl_icb32_to_axi64.v"
remove_design -verilog "D:/PDS/test/Sparrow_RISC-V/rtl/general/sirv_gnrl_xchecker.v"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/FIFO_AW/FIFO_AW.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/FIFO_CMD/FIFO_CMD.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/FIFO_RSP/FIFO_RSP.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/FIFO_W/FIFO_W.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/FIFO_WR/FIFO_WR.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/icmp_rx_ram_8_256/icmp_rx_ram_8_256.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/my_pll/my_pll.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/rd_fram_buf/rd_fram_buf.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/ref_clock/ref_clock.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/udp_shift_register/udp_shift_register.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/wr_fram_buf/wr_fram_buf.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/ddr3_100h/ddr3_100h.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/ddr3_test/ddr3_test.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/eth_rgmii_pll/eth_rgmii_pll.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/ipsxb_distributed_fifo/ipsxb_distributed_fifo.idf"
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/line_buffer/line_buffer.idf"
add_constraint "D:/PDS/test/Sparrow_RISC-V/soc.fdc"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/pll/pll.idf"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
add_design "D:/PDS/test/Sparrow_RISC-V/ipcore/cfg_pll/cfg_pll.idf"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
pnr 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module system_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
