#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Fri Jun 14 11:37:01 2024

set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
